Repository: CH83/foodcoopshop
Catalog: Locale/deu/LC_MESSAGES/default.po
Languages: de_de

source: Change your password
de_de: Passwort ändern

source: Your old Password was wrong
de_de: Dein altes Passwort war falsch.

source: Insert your new Password
de_de: Bitte gib dein neues Passwort ein.

source: The length of the password should be from 6 - 32 Chars
de_de: Das Passwort muss zwischen 6 und 32 Zeichen lang sein.

source: the new passwords are not the same
de_de: Die Passwörter stimmen nicht überein.

source: your new and your old Password dont differ, please change
de_de: Dein altes und dein neues Passwort sind gleich. Bitte ändern.

source: Please set your password
de_de: Bitte gib dein Passwort ein.

source: An error occurred, please check your form.
de_de: Beim Speichern sind Fehler aufgetreten!

source: your new password successfully set
de_de: Dein neues Passwort wurde erfolgreich gespeichert.

source: Password : Old Password *
de_de: Altes Passwort *

source: Password : New Password *
de_de: Neues Passwort *

source: Password : New Password Repeat *
de_de: Neues Passwort (nochmal) *
